<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads the latest FSLogix Apps archive from Microsoft.</string>
    <key>Identifier</key>
    <string>com.github.iancohn.download.FSLogix-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FSLogix</string>
        <key>SEARCH_URL</key>
        <string>https://aka.ms/fslogix-latest</string>
        <key>SEARCH_PATTERN</key>
        <string>https://download\.microsoft\.com/download/[a-f0-9\-/]+/FSLogix_Apps_[\d\.]+\.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/FSLogix</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%destination_path%/x64/Release/*.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%found_filename%</string>
                <key>extract_dir</key>
                <string>ExeExtract</string>
                <key>preserve_paths</key>
                <string>False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
            <key>Arguments</key>
            <dict>
                <key>bes_filepath</key>
                <string>%found_filename%</string>
                <key>output_var_name</key>
                <string>version</string>
                <key>bes_relevance</key>
                <string>(it as trimmed string) of preceding texts of first "%22" of following texts of first "DisplayVersion=%22" of lines 2 of file "%RECIPE_CACHE_DIR%/ExeExtract/0"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>version == "" OR version == "None" </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
